testScript.yml
config:
  target: "https://cslopenlrscontainer-openlrs.cloudapps.digital/"
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    - duration: 600
      arrivalRate: 50
  variables: 
    firstVariable:
      - "var1"
      - "var2"
    secondVariable:
      - "foo"
      - "bar"
  payload:
    path: "keywords.csv"
    fields:
      - "keywords"
scenarios:
  - name: "Search and select"
    flow:
      - post:
          url: "/search"
          body: "kw={{ keywords }}" 
          capture:
            json: "$.results[0].id"
            as: "id"
      - get:
          url: "/details/{{ id }}"
      - think: 3
      - post:
          url: "/course-name-id"
          json:
            productId: "{{ id }}"